#-------------------------------------------------
# [실습] 숫자를 입력 받아서 음이 아닌 정수와 음수 구분하기
#-------------------------------------------------

# num = int(input())

# if num >= 0:
#     print(f'{num}은 음이 아닌 정수 입니다')
# else :
#     print(f'{num}은 음수입니다')

#-------------------------------------------------
# [실습] 점수를 입력 받아서 합격과 불합격 출력
# - 합격 60 점 이상
#-------------------------------------------------

jumsu = int(input('점수를 입력하세요'))

if 100>=jumsu>=60:
    print(f'{jumsu} 점은 합격입니다.')
else:
    print(f'{jumsu} 점은 불합격입니다.')

#-------------------------------------------------
# [실습] 점수를 입력 받아서 학점 출력
# - 학점 : A,B,C,D,F
#-------------------------------------------------

jumsu2 = int(input('점수를 입력하세요'))

if 100>=jumsu2>=90:
    print(f'{jumsu2} 점은 A입니다.')
elif jumsu2>=80:
    print(f'{jumsu2} 점은 B입니다.')
elif jumsu2>=70:
    print(f'{jumsu2} 점은 C입니다.')
elif jumsu2>=60:
    print(f'{jumsu2} 점은 D입니다.')
else:
    print(f'{jumsu2}는 E입니다.')
